/*!
 * Тоог үсэг рүү хөрвүүлэгч
 * @хувилбар 1.0.3
 * @Зохиогч П.Батсайхан
 * @Лиценз GIT
 */
function toWords(num) {
  var a = [
    "",
    "нэг ",
    "хоёр ",
    "гурван ",
    "дөрвөн ",
    "таван ",
    "зургаан ",
    "долоон ",
    "найман ",
    "есөн "
  ];
  var b = [
    "",
    "арван",
    "хорин",
    "гучин",
    "дөчин",
    "тавин",
    "жаран",
    "далан",
    "наян",
    "ерэн"
  ];
  var c = [
    "",
    "нэг",
    "хоёр",
    "гурав",
    "дөрөв",
    "тав",
    "зургаа",
    "долоо",
    "найм",
    "ес"
  ];
  var d = ["", "арав", "хорь", "гуч", "дөч", "тавь", "жар", "дал", "ная", "ер"];

  if ((num = num.toString()).length > 15) return "Хэтэрхий их тоо байна";

  n = ("000000000000000" + num)
    .substr(-15)
    .match(
      /^(\d{1})(\d{2})(\d{1})(\d{2})(\d{1})(\d{2})(\d{1})(\d{2})(\d{1})(\d{2})$/
    );

  if (!n) return;
  var str = "";
  str +=
    n[1] != 0 && n[2] == 0
      ? a[Number(n[1])] + "зуун их наяд "
      : n[1] != 0
      ? a[Number(n[1])] + "зуун "
      : "";
  str +=
    n[2] != 0
      ? (a[Number(n[2])] || b[n[2][0]] + " " + a[n[2][1]]) + "их наяд "
      : "";
  str +=
    n[3] != 0 && n[4] == 0
      ? a[Number(n[3])] + "зуун тэрбум "
      : n[3] != 0
      ? a[Number(n[3])] + "зуун "
      : "";
  str +=
    n[4] != 0
      ? (a[Number(n[4])] || b[n[4][0]] + " " + a[n[4][1]]) + "тэрбум "
      : "";
  str +=
    n[5] != 0 && n[6] == 0
      ? a[Number(n[5])] + "зуун сая "
      : n[5] != 0
      ? a[Number(n[5])] + "зуун "
      : "";
  str +=
    n[6] != 0
      ? (a[Number(n[6])] || b[n[6][0]] + " " + a[n[6][1]]) + "сая "
      : "";
  str +=
    n[7] != 0 && n[8] == 0
      ? a[Number(n[7])] + "зуун мянга "
      : n[7] != 0
      ? a[Number(n[7])] + "зуун "
      : "";
  str +=
    n[8] != 0
      ? (a[Number(n[8])] || b[n[8][0]] + " " + a[n[8][1]]) + "мянга "
      : "";
  str +=
    n[9] != 0 && n[10] == 0
      ? a[Number(n[9])] + "зуу"
      : n[9] != 0
      ? a[Number(n[9])] + "зуун "
      : "";
  str +=
    n[10] != 0 && n[10][1] > 0
      ? b[n[10][0]] + " " + c[n[10][1]]
      : n[10] != 0
      ? d[n[10][0]]
      : "";

  return str.charAt(0).toUpperCase() + str.slice(1) + ".";
}
